       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG38.

      *    ALTERANDO DADOS DO ARQUIVO INDEXÇADO.


       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.

       FILE-CONTROL.

           COPY "SELFUNCIONARIO.cob".

       DATA DIVISION.

       FILE SECTION.

           COPY "FDFUNCIONARIO.cob".

       WORKING-STORAGE SECTION.


       77  REGISTRO-ENCONTRADO PIC X.
      *    POSSSUI MESMO TAMAANHO DO CODIGO DO FUNCIONARIO.
       77  CODIGO-FUNCIONARIO-ALTERAR  PIC 9(4).
      *    CAMPO QUE SERA ALTERADO.
       77  QUAL-CAMPO  PIC 9.

       PROCEDURE DIVISION.

       PROGRAM-BEGIN.
           OPEN I-O ARQUIVO-FUNCIONARIO.
           PERFORM PEGA-REGISTRO-FUNCIONARIO.

           PERFORM ALTERA-REGISTRO
                   UNTIL FUNCIONARIO-CODIGO IS EQUAL ZEROES.
           CLOSE ARQUIVO-FUNCIONARIO.
       PROGRAM-DONE.
           STOP RUN.


       PEGA-REGISTRO-FUNCIONARIO.
      *    INICIALIZACAO DAS VARIAVEIS.
           MOVE SPACE TO FUNCIONARIO-REGISTRO.
           MOVE ZEROES TO FUNCIONARIO-CODIGO.

      *    PERGUNTA QUAL REGISTRO DEVE SER ALTERADO.
           DISPLAY "INFORME O CODIGO DO FUNCIONARIO.".
           DISPLAY "PARA ALTERAR (1~9999) OU ".
           DISPLAY "DIGITE 0(ZERO) PARA CANCELAR".
           ACCEPT CODIGO-FUNCIONARIO-ALTERAR.

      *    ATRIBUI O CODIGO AO REGISTRO.

           MOVE CODIGO-FUNCIONARIO-ALTERAR TO FUNCIONARIO-CODIGO.

           MOVE "N" TO REGISTRO-ENCONTRADO.

           PERFORM ENCONTRA-REGISTRO-FUNCIONARIO
                   UNTIL REGISTRO-ENCONTRADO IS EQUAL "S" OR
                   FUNCIONARIO-CODIGO IS EQUAL ZEROES.


       ENCONTRA-REGISTRO-FUNCIONARIO.

           MOVE "S" TO REGISTRO-ENCONTRADO.
           READ ARQUIVO-FUNCIONARIO RECORD
      *    SE NAO ENCONTRAR O REGISTRO ATRINUI "N" A REGISTRO-ENCONTRADO
           INVALID KEY
           MOVE "N" TO REGISTRO-ENCONTRADO.


           IF REGISTRO-ENCONTRADO IS EQUAL "N"
               DISPLAY "REGISTRO NAO ENCONTRADO"
               DISPLAY "INFORME O CODIGO DO FUNCIONARIO"
               DISPLAY "PARA ALTERAR (1~9999) OU "
               DISPLAY "DIGITE 0(ZERO) PARA CANCELAR : "
               ACCEPT CODIGO-FUNCIONARIO-ALTERAR.
           MOVE CODIGO-FUNCIONARIO-ALTERAR TO FUNCIONARIO-CODIGO.

       ALTERA-REGISTRO.
      *    EXIBE TODOS OS CAMPOS DO REGISTRO.

           DISPLAY " ".
           DISPLAY "CODIGO : " FUNCIONARIO-CODIGO.
           DISPLAY "1.NOME : " FUNCIONARIO-NOME.
           DISPLAY "2.ENDERECO : " FUNCIONARIO-ENDERECO.
           DISPLAY "3.TELEFONE : " FUNCIONARIO-TELEFONE.
           DISPLAY "4.EMAIL : " FUNCIONARIO-EMAIL.
           DISPLAY " ".

           PERFORM ESCOLHE-CAMPO.


           PERFORM MUDA-E-GRAVA-UM-CAMPO.

           PERFORM PEGA-REGISTRO-FUNCIONARIO.

       MUDA-E-GRAVA-UM-CAMPO.
           IF QUAL-CAMPO IS EQUAL 1
               DISPLAY "INFORME O NOME : "
               ACCEPT FUNCIONARIO-NOME.

           IF QUAL-CAMPO IS EQUAL 2
               DISPLAY "INFORME O ENDERECO : "
               ACCEPT FUNCIONARIO-ENDERECO.

           IF QUAL-CAMPO IS EQUAL 3
               DISPLAY "INFORME O TELEFONE : "
               ACCEPT FUNCIONARIO-TELEFONE.

           IF QUAL-CAMPO IS EQUAL 4
               DISPLAY "INFORME O EMAIL : "
               ACCEPT FUNCIONARIO-EMAIL.

           PERFORM REESCREVER-REGISTRO.

       REESCREVER-REGISTRO.
           REWRITE FUNCIONARIO-REGISTRO
               INVALID KEY
               DISPLAY "ERRO AO REESCREVER O REGISTRO ".




       ESCOLHE-CAMPO.
      *    O USUARIO DEVE ESCOLHER UM CAMPO PARA ALTERAR.
           DISPLAY "DIGITE O NUMERO DO CAMPO".
           DISPLAY "PARA ALTERAR (1~4) OU 0(ZERO) PARA SAIR.".
           ACCEPT QUAL-CAMPO.
           IF QUAL-CAMPO < 1 OR QUAL-CAMPO > 4
              DISPLAY "CAMPO INVALIDO".
