       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG8.
      *    DEMONSTRA O USO DE PARAGRAFOS.

       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01  PRIMEIRO-NUMERO PIC 9(2).
       01  SEGUNDO-NUMERO PICTURE IS 99.
       01  RESULTADO      PICTURE IS 99.

       PROCEDURE DIVISION.

       PROGRAM-BEGIN.

           RECEBE-PRIMEIRO-NUMERO.

           DISPLAY " INFORME O PRIMEIRO NUMERO:"
           ACCEPT PRIMEIRO-NUMERO.

           RECEBE-SEGUNDO-NUMERO.
           DISPLAY " INFORME O SEGUNDO NUMERO:"
           ACCEPT SEGUNDO-NUMERO.

           EXECUTA-O-CALCULO.
           COMPUTE RESULTADO = PRIMEIRO-NUMERO + SEGUNDO-NUMERO.

           MOSTRA-O-RESULTADO.
           DISPLAY "O RESULTADO DA SOMA EH:" RESULTADO.

       PROGRAM-DONE.

           STOP RUN.
