       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG39.

      *    TRABALHANDO COM DELETE REGISTROS.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.

       FILE-CONTROL.

           COPY "SELFUNCIONARIO.cob".
       DATA DIVISION.

       FILE SECTION.

           COPY "FDFUNCIONARIO.cob".

       WORKING-STORAGE SECTION.

       77  REGISTRO-ENCONTRADO         PIC X.

       77  CODIGO-FUNCIONARIO-EXCLUIR  PIC 9(5).

       77  CONFIRMAR-EXCLUSAO          PIC X.

       PROCEDURE DIVISION.

       PROGRAM-BEGIN.

           OPEN I-O ARQUIVO-FUNCIONARIO.

           PERFORM PEGA-REGISTRO-FUNCIONARIO.

           PERFORM DELETAR-REGISTRO
                   UNTIL FUNCIONARIO-CODIGO IS EQUAL ZEROES.

           CLOSE ARQUIVO-FUNCIONARIO.


       PROGRAM-DONE.
           STOP RUN.


       PEGA-REGISTRO-FUNCIONARIO.
           MOVE SPACE TO FUNCIONARIO-REGISTRO.
           MOVE ZEROS TO FUNCIONARIO-CODIGO.

           DISPLAY "INFORME O CODIGO DO FUNCIONARIO".
           DISPLAY "PARA EXCLUIR (1~9999)".
           DISPLAY "DIGITE 0 (ZERO) PARA CANCELAR.".
           ACCEPT CODIGO-FUNCIONARIO-EXCLUIR.

           MOVE CODIGO-FUNCIONARIO-EXCLUIR TO FUNCIONARIO-CODIGO.

           MOVE "N" TO REGISTRO-ENCONTRADO.

           PERFORM ENCONTRA-REGISTRO-FUNCIONARIO
                   UNTIL REGISTRO-ENCONTRADO IS EQUAL "S" OR
                   FUNCIONARIO-CODIGO IS EQUAL ZEROES.

       ENCONTRA-REGISTRO-FUNCIONARIO.

           MOVE "S" TO REGISTRO-ENCONTRADO.
           READ ARQUIVO-FUNCIONARIO RECORD
                   INVALID KEY
                       MOVE "N" TO REGISTRO-ENCONTRADO.
           IF REGISTRO-ENCONTRADO IS EQUAL "N"
               DISPLAY "REGISTRO NAO ENCONTRADO"
               DISPLAY "INFORME O CODIGO DO FUNCIONARIO"
               DISPLAY "PARA EXCLUIR (1~9999)"
               DISPLAY "DIGITE 0(ZERO) PARA CANCELAR."
               ACCEPT CODIGO-FUNCIONARIO-EXCLUIR.

           MOVE CODIGO-FUNCIONARIO-EXCLUIR TO FUNCIONARIO-CODIGO.

       DELETAR-REGISTRO.

      *    EXIBIR TODOS OS CAMPOS DO REGISTRO.

           DISPLAY " ".
           DISPLAY "CODIGO : " FUNCIONARIO-CODIGO.
           DISPLAY "NOME : "   FUNCIONARIO-NOME.
           DISPLAY "ENDERECO : " FUNCIONARIO-ENDERECO.
           DISPLAY "TELEFONE : " FUNCIONARIO-TELEFONE.
           DISPLAY "EMAIL : " FUNCIONARIO-EMAIL.

           MOVE "X" TO CONFIRMAR-EXCLUSAO.

           PERFORM PERGUNTA-EXCLUIR
                   UNTIL CONFIRMAR-EXCLUSAO IS EQUAL "S" OR "N".

           IF CONFIRMAR-EXCLUSAO IS EQUAL "S"
               DELETE ARQUIVO-FUNCIONARIO RECORD
               INVALID KEY
               DISPLAY "ERRO AO EXCLUIR O REGISTRO.".

           PERFORM PEGA-REGISTRO-FUNCIONARIO.

       PERGUNTA-EXCLUIR.
           DISPLAY "DESEJA EXCLUIR ESTE REGISTRO ? (S/N).".
           ACCEPT CONFIRMAR-EXCLUSAO.
           IF CONFIRMAR-EXCLUSAO IS EQUAL "s"
               MOVE "S" TO CONFIRMAR-EXCLUSAO.
           IF CONFIRMAR-EXCLUSAO IS EQUAL "n"
               MOVE "N" TO CONFIRMAR-EXCLUSAO.

           IF CONFIRMAR-EXCLUSAO NOT IS EQUAL "S" AND
               CONFIRMAR-EXCLUSAO NOT IS EQUAL "N"
               DISPLAY "VOCE DEVE ESCOLHER SIM OU NAO".
