       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG23.

      *    DEMONSTRACAO DE INICIALIZACAO DE VARIAVEIS.

       ENVIRONMENT DIVISION.
       DATA DIVISION.

       WORKING-STORAGE SECTION.

       01  NUMERO      PIC 9(2) VALUE 15.
       01  MENSAGEM    PIC X(20) VALUE "CURSO DE COBOL".
       01  NUMERO2     PIC 9(2) VALUE ZEROS.
       01  TEXTO       PIC X(80) VALUE SPACE.

       PROCEDURE DIVISION.

       PROGRAM-BEGIN.

           DISPLAY "NUMERO : " NUMERO.
           DISPLAY "MENSAGEM : " MENSAGEM.
           DISPLAY "------"
           DISPLAY "NUMERO 2 : " NUMERO2.
           DISPLAY "TEXTO : " TEXTO.

           DISPLAY "ATRIBUINDO VALORES."
           ADD 20 TO NUMERO2.
           DISPLAY " NUMERO2 : " NUMERO2.

       PROGRAM-DONE.
           STOP RUN.
