       IDENTIFICATION DIVISION.

       PROGRAM-ID. PROG13.

      *    TRATANDO O CONDICIONAL IF.

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       01  RESPOSTA PIC X.


       PROCEDURE DIVISION.

       PROGRAM-BEGIN.

           PERFORM PERGUNTA.

           PERFORM EXIBE-RESPOSTA.

       PROGRAM-DONE.

           STOP RUN.

       PERGUNTA.
           DISPLAY " VOCE GOSTA DE CHURRACO SIM OU NAO ? (S / N)".
           ACCEPT RESPOSTA.

       EXIBE-RESPOSTA.
           IF RESPOSTA IS EQUAL "S"
               DISPLAY "REALMENTE EH MUITO BOM !".
           IF RESPOSTA IS EQUAL "N"
               DISPLAY "QUE PENA EH TAO BOM. :(".
