       IDENTIFICATION  DIVISION.
       PROGRAM-ID. PROG31.

      *    NIVEIS DE VARIAVEIS.

       ENVIRONMENT DIVISION.
       DATA DIVISION.



       WORKING-STORAGE SECTION.


       77  NOME PIC X(15).

       01  PESSOA.
           05 PESSOA-ESCOLARIDADE PIC X.
               88 ENSINO-FUNDAMENTAL VALUE "F".
               88 ENSINO-MEDIO VALUE "M".
               88 ENSINO-SUPERIOR VALUE "S".

       01  FUNCIONARIO.
           05 COD PIC 99.
           05 FILLER PIC X(1) VALUE "*".
           05 IDADE PIC 99.
           05 FILLER PIC X(1) VALUE "*".
           05 ENDERECO PIC X(20).

       66  FUNCIONARIO-DETALHES RENAMES COD THRU IDADE.




       PROCEDURE DIVISION.



       PROGRAM-BEGIN.

           DISPLAY "--- VARIAVEIS NIVEL 77 E 88 ---".
           DISPLAY "QUAL EH O SEU NOME?".
           ACCEPT NOME.
           DISPLAY "QUAL EH A SUA ESCOLARIDADE?".
           DISPLAY "F = FUNDAMENTAL | M = MEDIO | S = SUPERIOR".
           ACCEPT PESSOA-ESCOLARIDADE.

           IF PESSOA-ESCOLARIDADE IS EQUAL "F"
               DISPLAY NOME " VOCE AINDA ESTA NO INICIO DOS ESTUDOS".
           IF PESSOA-ESCOLARIDADE IS EQUAL "M"
               DISPLAY NOME " VOCE ESTA NA METADE DO CAMINHO".
           IF PESSOA-ESCOLARIDADE IS EQUAL "S"
               DISPLAY NOME "VOCE ESTA NA UNIVERSIDADE."


           DISPLAY "--- VARIAVEL NIVEL 66 ----".
           DISPLAY "INFORME O CODIGO DO FUNCIONARIO".
           ACCEPT COD.
           DISPLAY "INFORME A IDADE DO FUNCIONARIO".
           ACCEPT IDADE.
           DISPLAY "INFORME O ENDERECO DO FUNCIONARIO".
           ACCEPT ENDERECO.

           DISPLAY "---- EXIBINDO FUNCIONARIO-DETALHES ----".
           DISPLAY FUNCIONARIO-DETALHES.

       PROGRAM-DONE.
           STOP RUN.
