       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG34.

      *    TRABALHANDO COM TIPOS DE ARQUIVOS IDEXADOS.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

      *    NAO EXISTE O COMANDO OPTIONAL EM ARQUIVOS INDEXADOS.
           SELECT ARQUIVO-FUNCIONARIO
           ASSIGN TO "funcionarios.dat"
           ORGANISATION IS INDEXED
           RECORD KEY IS FUNCIONARIO-CODIGO
           ACCESS MODE IS DYNAMIC.

       DATA DIVISION.
       FILE SECTION.
       FD  ARQUIVO-FUNCIONARIO.
       01  FUNCIONARIO-REGISTRO.
           05  FUNCIONARIO-CODIGO      PIC 9(4).
           05  FUNCIONARIO-NOME        PIC X(20).
           05  FUNCIONARIO-ENDERECO    PIC X(50).
           05  FUNCIONARIO-TELEFONE    PIC X(20).
           05  FUNCIONARIO-EMAIL       PIC X(15).

       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.

       PROGRAM-BEGIN.
           OPEN OUTPUT ARQUIVO-FUNCIONARIO.

           CLOSE ARQUIVO-FUNCIONARIO.

       PROGRAM-DONE.
           STOP RUN.
