       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG5.

      *    TRATANDO O COMANDO MOVE. ELE ATRIBUI UM VALOR PARA UMA
      *    VARIAVEL.

       ENVIRONMENT DIVISION.
       DATA DIVISION.

       WORKING-STORAGE SECTION.

       01  MINHA-MENSAGEM PIC X(30).
       01  NOME PIC X(30).
       01  NUMERO PIC 9(2).





       PROCEDURE DIVISION.

       PROGRAM-BEGIN.

           DISPLAY "QUAL EH O SEU NOME ?".
           ACCEPT NOME.

           MOVE " OLA " TO MINHA-MENSAGEM.
           MOVE 1 TO NUMERO.

           DISPLAY " MENSAGEM " NUMERO " : " MINHA-MENSAGEM NOME.

           MOVE " TCHAU " TO MINHA-MENSAGEM.

           MOVE 2 TO NUMERO.

           MOVE  "ELBER CANDIDO" TO NOME.

           DISPLAY " MENSAGEM " NUMERO " : " MINHA-MENSAGEM NOME.


       PROGRAM-DONE.

           STOP RUN.
